Tekla Open API Reference for Tekla Structures 2025
Matrix Constructor
Overload List
Name | Description
Matrix()
 Creates a new indentity matrix.
Matrix(Matrix)
 Creates a new matrix which is a copy of the given matrix.
Top
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace